# LAB TASK 3

## Name: Areeka Aijaz
## ID: K17-3913
## Date: 24/February/2021

# Question 2

In [1]:
import pandas as pd

data1 = {'Cities' : ['Lahore', 'Karachi'],
        'Provinces' : ['Punjab', 'Sindh']}

data2 = {'Cities' : ['Islamabad', 'Karachi', 'Peshawar', 'Quetta'],
        'Provinces' : ['Capital', 'Sindh', 'KPK', 'Balochistan']}

In [2]:
frame1 = pd.DataFrame(data = data1)
frame1

    Cities Provinces
0   Lahore    Punjab
1  Karachi     Sindh

In [3]:
frame2 = pd.DataFrame(data = data2)
frame2

      Cities    Provinces
0  Islamabad      Capital
1    Karachi        Sindh
2   Peshawar          KPK
3     Quetta  Balochistan

In [4]:
# Combine frame 1 & frame 2
frame3 = pd.concat([frame1, frame2], ignore_index = True)
frame3

      Cities    Provinces
0     Lahore       Punjab
1    Karachi        Sindh
2  Islamabad      Capital
3    Karachi        Sindh
4   Peshawar          KPK
5     Quetta  Balochistan

In [5]:
# Remove duplicates
frame3.drop_duplicates(inplace = True)
frame3

      Cities    Provinces
0     Lahore       Punjab
1    Karachi        Sindh
2  Islamabad      Capital
4   Peshawar          KPK
5     Quetta  Balochistan

In [6]:
# Sort based on Provinces
frame3.sort_values(by = 'Provinces', inplace = True)
frame3

      Cities    Provinces
5     Quetta  Balochistan
2  Islamabad      Capital
4   Peshawar          KPK
0     Lahore       Punjab
1    Karachi        Sindh

In [7]:
frame3.sort_index(inplace = True, ascending = False, ignore_index = True)
frame3

      Cities    Provinces
0     Quetta  Balochistan
1   Peshawar          KPK
2  Islamabad      Capital
3    Karachi        Sindh
4     Lahore       Punjab

# Question 3

In [8]:
data = pd.DataFrame(data = {'Name' : ["", "Ali", "Ahmed", "Nida", ""],
                            'Field' : ['C', 'E', 'E', 'C', 'C'],
                            'Age' : ['', '', '', '', ''],
                            'Marks' : [-90, 60, -10, 70, 75]})
data

    Name Field Age  Marks
0            C        -90
1    Ali     E         60
2  Ahmed     E        -10
3   Nida     C         70
4            C         75

In [9]:
# Drop column Age
data = data.drop(columns = 'Age')
data

    Name Field  Marks
0            C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4            C     75

In [10]:
# Replace empty string
data = data.replace({'Name' : {'' : '---'}})
data

    Name Field  Marks
0    ---     C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4    ---     C     75

In [11]:
# Replace 'C' with 0 & 'E' with 1
data['Field'].replace({'C' : 0, 'E' : 1}, inplace = True)
data

    Name  Field  Marks
0    ---      0    -90
1    Ali      1     60
2  Ahmed      1    -10
3   Nida      0     70
4    ---      0     75

In [12]:
# Replace negative marks with average of valid marks
data['Marks'] = data['Marks'].where(data['Marks'] >= 0)
data['Marks'].fillna(round(data['Marks'].mean(), 3), inplace = True)
data

    Name  Field   Marks
0    ---      0  68.333
1    Ali      1  60.000
2  Ahmed      1  68.333
3   Nida      0  70.000
4    ---      0  75.000